# Pandas notes

## Pandas Series (and is advantages over a List)

In [37]:
# Indexing - pd.Series allows for labeled indexing, which means you can access data using labels instead of just integer positions.
import pandas as pd
s = pd.Series([1, 2, 3], index=['a', 'b', 'c']) # if you skip the index, it will be 0, 1, 2, ...
print(s['a'])  # Output: 1

1

In [38]:
# Data Alignement - When adding two series, the data aligns based on the index. If the index does not match, the result will be NaN.
s1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
s2 = pd.Series([4, 5, 6], index=['b', 'c', 'd'])
print(s1 + s2)

a    NaN
b    6.0
c    8.0
d    NaN
dtype: float64

In [39]:
# Vectorized Operations: pd.Series supports vectorized operations, which means you can perform operations on the entire series without needing to loop through each element.
s = pd.Series([1, 2, 3])
print(s * 2)

0    2
1    4
2    6
dtype: int64

In [40]:
s3 = pd.Series(range(10), index=range(10))
print(s3)
print(s3>5)    # Output: True for values > 5, False for values <= 5
print(s3[s3>5])    # Output: values > 5

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9     True
dtype: bool
6    6
7    7
8    8
9    9
dtype: int64

In [41]:
# Sample dictionary
data = {'a': 1, 'b': 2, 'c': 3, 'd': 4}

# Transform dictionary into pd.Series
series = pd.Series(data)    # key becomes index, value becomes value

# Print the resulting Series
print(series)

a    1
b    2
c    3
d    4
dtype: int64

## Pandas DataFrame

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

# Transform dictionary into pd.DataFrame
df = pd.DataFrame(data)

# Print the resulting DataFrame
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [7]:
data['Name'].append('David')
data['Age'].append(40)
data['City'].append('Boston')
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40       Boston

In [23]:
# Filtering DataFrames - 2 methods, or actually 3
# 1. using square brackets
filtered_df = df[['Age', 'City']]    # Output: DataFrame with only 'Age' and 'City' columns
print(filtered_df)                   # Interesting that columns filtering needs double square brackets
print('-----------------')

filtered_df = df[df['Age'] > 30]    # Output: DataFrame with only rows where 'Age' > 30
print(filtered_df)
print('-----------------')

filtered_df = df[:2]    # Output: First two rows of the DataFrame
print(filtered_df)
print('-----------------')

filtered_df = df[2:3][['Age', 'Name']]    # Fixed: Use double square brackets to select multiple columns, first rows then columns
print(filtered_df)                        # Intereeesting that rows filtering needs single square brackets
print('-----------------')

# 2. using dot notation - this however will not work if the column name has spaces or special characters

print(f'{df.Age}\n{df.Name}')    # Output: 'Age' and 'Name' columns of the DataFrame
print('-----------------')

   Age         City
0   25     New York
1   30  Los Angeles
2   35      Chicago
3   40       Boston
-----------------
      Name  Age     City
2  Charlie   35  Chicago
3    David   40   Boston
-----------------
    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles
-----------------
   Age     Name
2   35  Charlie
-----------------
0    25
1    30
2    35
3    40
Name: Age, dtype: int64
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object
-----------------

In [28]:
# 3. using loc and iloc
# loc is a method to select rows by labels based indexes
# df.loc[what rows to filter, what columns to select]
# iloc is a method to select rows by integer based indexes
# df.iloc[what rows to filter, what columns to select]

print(df.loc[: , ['Age', 'Name']])    # Output: 'Age' and 'Name' columns of the DataFrame
print('-----------------')

print(df.loc[1:2 , ['Age', 'Name']])    # Output: 'Age' and 'Name' columns of the DataFrame but only rows 1 and 2

print(df.iloc[1:2 , [0, 1]])    # Output: 'Age' and 'Name' columns of the DataFrame but only rows 1 to 2 (without 2)

   Age     Name
0   25    Alice
1   30      Bob
2   35  Charlie
3   40    David
-----------------
   Age     Name
1   30      Bob
2   35  Charlie

      Name  Age
1      Bob   30
2  Charlie   35

## Loading data into DataFrame

In [1]:
import pandas as pd

df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0) # header=0 means the first row is header row
# header can be None, which means there is no header row, in such case pandas will assign default header row which is 0, 1, 2, ...
# we can create header with names by passing a list of names to header parameter

print(df.head())    # Output: first 5 rows of the DataFrame
# this looks bad in stadard terminal, maybe its better to rely on jupyter notebook for this and skip print
df.head()    # Output: first 5 rows of the DataFrame

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
# so with list of names for headers (which since we already have header will overwrite):
df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0, names=['Name', 'Age', 'City', 'Country', 'Job'])
df.head()

,,,,,,,Name,Age,City,Country,Job
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# we can also sometimes need to use labels for rows, in such case we can use index_col parameter
df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0, index_col='Name')
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# sometimes we need to only load specific columns, in such case we can use usecols parameter
df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0, usecols=['Name', 'Age'])
df.head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [5]:
# to find out data types of each column

df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0)
print(df.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
# this is however not accurate since Survived is actually a bool, so we can adjust that by:
df = pd.read_csv('../ML_intel_cert_project/dataset/train.csv', header=0, dtype={'Survived': bool})
print(df.dtypes) # actually its better to use .info() method as it prints this and more
df.head()

PassengerId      int64
Survived          bool
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,False,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,True,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,True,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,True,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,False,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.shape

(891, 12)

In [8]:
df.count() # count of non-null values in each column

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [9]:
print(df['Age'].unique(), '\n-------\n') # unique values in Age column
print(df['Age'].nunique(), '\n-------\n') # number of unique values in Age column
print(df['Age'].value_counts(), '\n-------\n') # count of each unique value in Age column
print(df['Age'].value_counts(normalize=True).apply(lambda x: f'{x:.2%}'), '\n-------\n') # percentage of each unique value in Age column

[22.   38.   26.   35.     nan 54.    2.   27.   14.    4.   58.   20.
 39.   55.   31.   34.   15.   28.    8.   19.   40.   66.   42.   21.
 18.    3.    7.   49.   29.   65.   28.5   5.   11.   45.   17.   32.
 16.   25.    0.83 30.   33.   23.   24.   46.   59.   71.   37.   47.
 14.5  70.5  32.5  12.    9.   36.5  51.   55.5  40.5  44.    1.   61.
 56.   50.   36.   45.5  20.5  62.   41.   52.   63.   23.5   0.92 43.
 60.   10.   64.   13.   48.    0.75 53.   57.   80.   70.   24.5   6.
  0.67 30.5   0.42 34.5  74.  ]
-------

88
-------

Age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64
-------

Age
24.00    4.20%
22.00    3.78%
18.00    3.64%
19.00    3.50%
28.00    3.50%
         ...
36.50    0.14%
55.50    0.14%
0.92     0.14%
23.50    0.14%
74.00    0.14%
Name: proportion, Length: 88, dtype: object
-------

In [10]:
# yet another stats from df

print(df.describe(), '\n-------\n') # basic stats for each column
print(df.describe(include='all'), '\n-------\n') # basic stats for each column, including non-numeric ones
print(df['Age'].describe(), '\n-------\n') # basic stats for Age column
print(df['Age'].min(),'\n-------\n', df['Age'].max(), '\n-------\n') # min and max value in Age column
print(df['Age'].mean(), '\n-------\n') # mean value in Age column
print(df['Survived'].sum(), '\n-------\n') # sum of values in Survived column (since its bool, sum will be count of True values)

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    2.308642   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.836071   14.526497    1.102743    0.806057   49.693429
min       1.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    2.000000   20.125000    0.000000    0.000000    7.910400
50%     446.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    3.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    3.000000   80.000000    8.000000    6.000000  512.329200
-------

        PassengerId Survived      Pclass                     Name   Sex  \
count    891.000000      891  891.000000                      891   891
unique          NaN        2         NaN                      891     2
top             NaN    False         NaN  Braund, Mr. Owen Harris  male
freq            NaN      549         NaN                        1   577
mean     446.000000      NaN    2.308642                      NaN   NaN
std      257.353842      NaN    0.836071                      NaN   NaN
min        1.000000      NaN    1.000000                      NaN   NaN
25%      223.500000      NaN    2.000000                      NaN   NaN
50%      446.000000      NaN    3.000000                      NaN   NaN
75%      668.500000      NaN    3.000000                      NaN   NaN
max      891.000000      NaN    3.000000                      NaN   NaN

               Age       SibSp       Parch  Ticket        Fare    Cabin  \
count   714.000000  891.000000  891.000000     891  891.000000      204
unique         NaN         NaN         NaN     681         NaN      147
top            NaN         NaN         NaN  347082         NaN  B96 B98
freq           NaN         NaN         NaN       7         NaN        4
mean     29.699118    0.523008    0.381594     NaN   32.204208      NaN
std      14.526497    1.102743    0.806057     NaN   49.693429      NaN
min       0.420000    0.000000    0.000000     NaN    0.000000      NaN
25%      20.125000    0.000000    0.000000     NaN    7.910400      NaN
50%      28.000000    0.000000    0.000000     NaN   14.454200      NaN
75%      38.000000    1.000000    0.000000     NaN   31.000000      NaN
max      80.000000    8.000000    6.000000     NaN  512.329200      NaN

       Embarked
count       889
unique        3
top           S
freq        644
mean        NaN
std         NaN
min         NaN
25%         NaN
50%         NaN
75%         NaN
max         NaN
-------

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64
-------

0.42
-------
 80.0
-------

29.69911764705882
-------

342
-------

In [11]:
#methods chaining
print(df['Age'].value_counts().sort_index(), '\n-------\n') # count of each unique value in Age column, sorted by index
print(df['Age'].value_counts().sort_index(ascending=False), '\n-------\n') # count of each unique value in Age column, sorted by index in descending order
print(df.isnull().sum(), '\n-------\n') # count of null values in each column

Age
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Name: count, Length: 88, dtype: int64
-------

Age
80.00    1
74.00    1
71.00    2
70.50    1
70.00    2
        ..
0.92     1
0.83     2
0.75     2
0.67     1
0.42     1
Name: count, Length: 88, dtype: int64
-------

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
-------

In [16]:
# sort and rank
print(df.sort_values(by='Age', ascending=False)[['Name', 'Age']].head(5), '\n-------\n') # pick 5 oldest passengers and print only Name and Age columns

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0
851                   Svensson, Mr. Johan  74.0
493               Artagaveytia, Mr. Ramon  71.0
96              Goldschmidt, Mr. George B  71.0
116                  Connors, Mr. Patrick  70.5
-------

In [31]:
#filtering
print(df.head(5)['Sex'] == 'female', '\n-------\n') # boolean mask for first 5 passengers that are
print(df[df['Sex'] == 'female'], '\n-------\n') #
print(df[(df['Age'] > 60) & (df['Sex'] == 'female')], '\n-------\n')

#another nice way will be with loc:
#print(df.loc[conditions, what columns to print]
condition = (df['Age'] > 60) & (df['Sex'] == 'female')
print(df.loc[condition, ['Name', 'Age', 'Sex']], '\n-------\n')

0    False
1     True
2     True
3     True
4    False
Name: Sex, dtype: bool
-------

     PassengerId  Survived  Pclass  \
1              2      True       1
2              3      True       3
3              4      True       1
8              9      True       3
9             10      True       2
..           ...       ...     ...
880          881      True       2
882          883     False       3
885          886     False       3
887          888      True       1
888          889     False       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
8        2            347742  11.1333   NaN        S
9        0            237736  30.0708   NaN        C
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
882      0              7552  10.5167   NaN        S
885      5            382652  29.1250   NaN        Q
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S

[314 rows x 12 columns]
-------

     PassengerId  Survived  Pclass                                       Name  \
275          276      True       1          Andrews, Miss. Kornelia Theodosia
483          484      True       3                     Turkula, Mrs. (Hedwig)
829          830      True       1  Stone, Mrs. George Nelson (Martha Evelyn)

        Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275  female  63.0      1      0   13502  77.9583    D7        S
483  female  63.0      0      0    4134   9.5875   NaN        S
829  female  62.0      0      0  113572  80.0000   B28      NaN
-------

                                          Name   Age     Sex
275          Andrews, Miss. Kornelia Theodosia  63.0  female
483                     Turkula, Mrs. (Hedwig)  63.0  female
829  Stone, Mrs. George Nelson (Martha Evelyn)  62.0  female
-------

In [36]:
#grouping
print(df[['Sex', 'Fare']].groupby('Sex').mean(), '\n-------\n') # mean
print(df.groupby('Survived')['Age'].mean(), '\n-------\n') # mean age of survived and not survived passengers

             Fare
Sex
female  44.479818
male    25.523893
-------

Survived
False    30.626179
True     28.343690
Name: Age, dtype: float64
-------